# NumberOfSegments Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..NumberOfSegments Property
Dimension Class See Also
---
The number of segments for the dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfSegments { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSegments As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSegments {
	int get ();
}
```

# See Also
Dimension Class
Autodesk.Revit.DB Namespace